# DataFrame에서 데이터 추출

- 열 (컬럼, column 세로백터) 단위 데이터 추출
    - 방식 : DF객체변수명[컬럼명]  or  DF객체변수명.컬럼명

- 행 (로우, row 가로백터) 단위 데이터 추출
    - 방식 : DF객체변수명.loc[인덱스라벨]  (숫자, 문자 모두 가능) 또는 DF객체변수명.iloc[정수인덱스]
    

- 1개 원소 단위 데이터 추출
- (행과 열을 이용해서 1개 원소를 뽑아야되므로 loc나 iloc는 무조건 쓴다고 보면 됨)
- 방식 : DF객체변수명.loc[행인덱스라벨, 열인덱스라벨]   또는  DF객체변수명.[행인덱스라벨].[열인덱스라벨]  
- DF객체변수명.iloc[행인덱스, 열인덱스]  또는   DF객체변수명.[행인덱스].[열인덱스]

In [24]:
# 모듈 로딩
import pandas as pd

# DF객체 생성
df = pd.DataFrame([[1,2,3], [11,22,33]])

# DF객체 출력
print(df)

# DataFrame 요약 정보 출력 메서드
df.info()
# rangeindex는 행을 뜻하는 것
# 아래쪽에 가서 보겠지만 column은 열을 뜻하는 것 => 정수로 0,1,2 되어 있음 => 문자열로는 안되는 것

    0   1   2
0   1   2   3
1  11  22  33
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
dtypes: int64(3)
memory usage: 176.0 bytes

In [2]:
# DF객체 구성 확인
df

    0   1   2
0   1   2   3
1  11  22  33

In [5]:
# 열(세로) 데이터 추출

# DF객체변수명[컬럼명]
oneCol = df[0]

print(f'oneCol = > \n{oneCol}', f'oneCol Type => {type(oneCol)}', sep='\n')

oneCol = >
0     1
1    11
Name: 0, dtype: int64
oneCol Type => <class 'pandas.core.series.Series'>

In [8]:
twoCol = df[[0,2]]
print(f'oneCol = > \n{twoCol}', f'oneCol Type => {type(twoCol)}', sep='\n')
# 시리즈와 마찬가지로 2개 이상이 되면 데이터프레임도 타입이 DataFrame이 됨

oneCol = >
    0   2
0   1   3
1  11  33
oneCol Type => <class 'pandas.core.frame.DataFrame'>

In [1]:
twoCOl = df[0:2]
print(f'oneCol = > \n{twoCol}', f'oneCol Type => {type(twoCol)}', sep='\n')

NameError: name 'df' is not defined

In [15]:
# DF객체의 column 속성변경
df.columns=['one','two','three']
df.info

<bound method DataFrame.info of    one  two  three
0    1    2      3
1   11   22     33>

In [ ]:
twoCOl = df['one':'three']
print(f'oneCol = > \n{twoCol}', f'oneCol Type => {type(twoCol)}', sep='\n')
# 오류가 생기지 => why : 컬럼으로 슬라이싱 할 때는 
세로 백터(열)는 문자열로 슬라이싱 불가 !주의!
(시리즈는 가능하지만)
# rangeindex - god
# column - 열 표시된 것

# 행(row, 가로) 데이터 추출

DF객체변수명.loc[], DF객체변수명.iloc[]

In [17]:
# DF 객체 데이터 확인
df

   one  two  three
0    1    2      3
1   11   22     33

In [19]:
# 11, 22, 33 라인 전체 추출
# df[1]  # 1->'one' 해서 오류남
oneRow = df.iloc[1]

print(f'oneRow = > \n{oneRow}', f'oneRow Type => {type(oneRow)}', sep='\n')

# 가로 백터, 세로 백터 => 하나로 뺀 것이라서 꼭 컬럼이 아니더라도 시리즈 가능

# 세로로 뽑는 건 컬럼명, 가로로 뽑는 건 iloc나 loc를 써서 뽑으면 됨

oneRow = >
one      11
two      22
three    33
Name: 1, dtype: int64
oneRow Type => <class 'pandas.core.series.Series'>

In [21]:
oneRow = df.loc[1]

print(f'oneRow = > \n{oneRow}', f'oneRow Type => {type(oneRow)}', sep='\n')

# 인덱스 라벨은 별도로 정하지 않았기 때문에 직전과 똑같이 나오는 것

oneRow = >
one      11
two      22
three    33
Name: 1, dtype: int64
oneRow Type => <class 'pandas.core.series.Series'>

In [25]:
twoRow = df.iloc[[0,1]]  # 2개라서 리스트에 담는 것
print(f'twoRow = > \n{twoRow}', f'twoRow Type => {type(twoRow)}', sep='\n')

twoRow = >
    0   1   2
0   1   2   3
1  11  22  33
twoRow Type => <class 'pandas.core.frame.DataFrame'>

In [42]:
# 딕셔너리 자료 -> key가 컬럼이 되지
# 106
# -> 행인덱스를 뽑는 경우,

In [43]:
exam_data = {'수학':[90,80,70], '영어':[98,89,95],
             '음악':[85,95,100], '체육':[100,90,90]}
df2 = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [44]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 서준 to 인아
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 120.0+ bytes

In [48]:
# 우현학생의 성적만 추출 (loc 사용) - 문자, 정수 모두 가능
df2.loc['우현']

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [49]:
# 인아학생의 성적만 추출 (iloc 사용) - 정수만 가능
df2.iloc[2]

수학     70
영어     95
음악    100
체육     90
Name: 인아, dtype: int64

In [56]:
# 음악과목의 성적만 추출
oneCol = df2.음악
oneCol

서준     85
우현     95
인아    100
Name: 음악, dtype: int64

In [55]:
oneCol = df2['음악']
oneCol

서준     85
우현     95
인아    100
Name: 음악, dtype: int64

In [57]:
# 우현 학생의 음악 점수만 추출
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [65]:
# 행 -> loc , iloc   떠올리기
# DF에서 원소 추출 => iloc[ 행, 열 ]  또는  loc[ 행, 열 ]
# i가 붙으면 정수라고 생각하기

# woo = df2.loc['우현','음악']  이것도 가능 (콤마(,)찍는 것)
woo = df2.loc['우현']['음악']   # 콤마(,) 없이 따로 찍는 것도 가능
print(f'woo => {woo}', f'woo type = > {type(woo)}',sep='\n')

woo => 95
woo type = > <class 'numpy.int64'>

In [64]:
woo = df2.iloc[1,2]
print(f'woo => {woo}', f'woo type = > {type(woo)}',sep='\n')

# i라면 정수를 써야된다는 것으로 바로 연결되도록!!

woo => 95
woo type = > <class 'numpy.int64'>

In [68]:
# select = df2[1][2]     # loc나 iloc가 없으니 밑에와 다른 경우지
select = df2['수학'][2]  # 컬럼 뽑고, 해당 컬럼의 원소를 뽑는 것이고
select
#iloc와 loc 없이 객체명[] 은 컬럼 뽑는 것 (df2[1]) 시리즈의 2번요소
# iloc나 loc가 안나오면 '열'로 생각하라

70

In [69]:
oneCol = df2['수학']
oneCol[2]

70

In [70]:
# 행이나 열을 뽑으면, 그 이후는 다 메서드를 쓰는 것
# => 평균, 분산, 최댓값, 최솟값 등 통계적인 것들

# DF에 행과 열 추가하기

- 행 추가 => DF객체변수명.loc[행라벨] = 데이터

- 열 추가 => DF객체변수명[컬럼] = 데이터

In [73]:
# 행(row) 추가하기
df2.loc['현진']=[100, 100, 100, 100]
df2

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   95  100   90
혜진  100  100  100  100
현진  100  100  100  100

In [75]:
# df2.loc['구름']=[100,90]  오류
df2.loc['구름']=100
df2
# 하나의 로우를 작성하는데 컬럼마다 다 같은 값이 들어간다면,
# 이렇게 한번만 적으면 된다

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   95  100   90
혜진  100  100  100  100
현진  100  100  100  100
구름  100  100  100  100

In [77]:
# 열(컬럼, column) 추가하기
df2['국어']=[100,100,100,100,100,100]
df2

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
인아   70   95  100   90  100
혜진  100  100  100  100  100
현진  100  100  100  100  100
구름  100  100  100  100  100

In [81]:
df2['국어']=[0,0,0,0,0,100]
df2
    # 있는 것은 덮어써짐
    # 없는 것은 추가됨

     수학   영어   음악   체육   국어
서준   90   98   85  100    0
우현   80   89   95   90    0
인아   70   95  100   90    0
혜진  100  100  100  100    0
현진  100  100  100  100    0
구름  100  100  100  100  100

# DF에서 행과 열 삭제하기

 - 보통 데이터에서 행 자체를 완전한 데이터라고 본다
 - 컬럼의 경우는 단순히 동일한 데이터라고 본다

- 삭제 관련 메서드 => drop()
    - 삭제의 경우, 기본적으로 행을 삭제한다고 본다
    - 행 삭제 : DF객체변수명.drop(행, axis = 0)  # 0이 디폴트값
    - 열 삭제 : DF객체변수명.drop(열, axis = 1)  # 1로 주어야 '열'로 인식함
    
- drop() 특징
    - 실제 데이터를 삭제하지 않고, backup을 갖고 있음
    - 복사본을 만들어서, 거기서 삭제하고, 삭제한 복사본을 반환하는 것
    - 실제 데이터(원본 데이터) 삭제하기 => inplace = True 를 파라미터로 입력
    (고로, inplace의 디폴트 값은 False 라는 것)

In [83]:
# 혜진 학생 성적 제거 (# 101-102)
df2.drop('혜진')

     수학   영어   음악   체육   국어
서준   90   98   85  100    0
우현   80   89   95   90    0
인아   70   95  100   90    0
현진  100  100  100  100    0
구름  100  100  100  100  100

In [91]:
df2
# 삭제했던 혜진이 있네!?
# drop을 쓸 경우 복사본에서 지우고 출력해주는 것임 => 원본은 살아 있음)

     수학   영어   음악   체육  국어
서준   90   98   85  100   0
우현   80   89   95   90   0
인아   70   95  100   90   0
혜진  100  100  100  100   0

In [107]:
# df3 = df2.drop('인아', inplace=True)
# print(df3)
# # 이미 없는 데이터라 'None' 뜨게 됨
# # 다시 돌려서 오류 뜸
# # 해당 행을 두번째 지우면 아래와 같이 오류가 나게 됨

In [104]:
df2
# 다시금 확인해보면 '서준'과 '우현'만 있는 것을 확인할 수 있음

    수학  영어  음악   체육  국어
서준  90  98  85  100   0
우현  80  89  95   90   0

In [113]:
# 열 삭제 => 수학 컬럼
# => DF객체변수명.drop(행, axis=1, inplace=True)  # 원본 날리는 것
df2.drop('수학', axis=1, inplace=True)
# 다시금 하면 오류생기지 (지금 돌리면 오류나겠지?)

In [111]:
df2.drop(3, axis=1)
# 컬럼의 경우, 정수로 하면 오류가 생기네 => 문자로 되어 있으니 문자만 가능

In [115]:
df2
# 당연히 inplace=True 했으니까 죽었지

    영어  음악   체육  국어
서준  98  85  100   0
우현  89  95   90   0

In [ ]:
# 행 -> loc, iloc
# 컬럼 -> 대괄호([])
# 원소 -> '행'이 들어가서 무조건 loc, iloc를 써야한다는 것
# 데이터를 지운다고 하면 '행'을 지우는 것
# 인덱스를 바꾸는 경우, 원본을 두는 것이 기본임
# 무조건 원본에 변경을 가하고 싶으면 inplace=True를 쓰는 것이지

# 행과 열의 전환

- 행->열 or 열->행 

- 방법
    - 메서드 : DF객체변수명.transpose() 
    - 속  성 : DF객체변수명.T

In [117]:
df2

    영어  음악   체육  국어
서준  98  85  100   0
우현  89  95   90   0

In [118]:
# 현재 DF 객체의 형태 => shape속성
df2.shape

(2, 4)

In [119]:
# 행<->열 전환
df2.T

     서준  우현
영어   98  89
음악   85  95
체육  100  90
국어    0   0

In [121]:
df2.shape
# 똑같이 (2, 4)로 나오는 것을 보니, 복사본을 변경한 것

(2, 4)

In [127]:
# df2.trnaspose(inplace=True)
# 오류 발생 : 모든 메서드에 inplace 옵션이 있는 것이 아니다.
df2 = df2.transpose()  #저장해주면 되지
# 다시 돌려주면 바뀌징
df2.shape   # (4, 2)로 바뀌게 확인

(2, 4)

In [128]:
# 정수 - 문자
# 행 - 컬럼
# 인덱스 => 정리해서 질문할 것
# 행은 정수(기존) + 문자열 (라벨) => 모두 가능
# 열은 문자열 (라벨) 이라면 => 라벨만 가능
# 모든 기능에 대한 행과 열의 성질은 위의 내용 모두 해당 되는 것!!